# Session 1 - Introduction to Pandas

## Installing and Importing Pandas

In [1]:
# pip install pandas

import pandas as pd
print(pd.__version__)

2.2.2

## Series

- Series is a one-dimensional array-like object that can hold a variety of data types, including integers, floats, and strings. A Series is essentially a column in a DataFrame, and can be thought of as a single column of data.
- Not only is each attribute a series, but each row is also a series.

In [2]:
import pandas as pd

# Creating a Series
data = pd.Series([10, 20, 30, 40, 50], index=['a', 'b', 'c', 'd', 'e'])
print(data)

a    10
b    20
c    30
d    40
e    50
dtype: int64

- Access elements using these indices

In [3]:
print(data['c'])  # Output: 30

30

- We can print values, and index by the following command:

In [4]:
print(data.index)
print(data.values)

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')
[10 20 30 40 50]

- If we want to change the index of a series, we will encounter this error:

In [6]:
try:  
    data.index[0] = 'z'  
except Exception as e:  
    print(f"An error occurred: {e}")

An error occurred: Index does not support mutable operations

- The index ['a', 'b', 'c'] is immutable. If you want to change the index, you can do so by reassigning it:

In [7]:
new_series = data.rename(index={'a': 'x', 'b': 'y'})
new_series

x    10
y    20
c    30
d    40
e    50
dtype: int64

## DataFrame: The Two-Dimensional Data Structure

In [8]:
# Creating a DataFrame
data = {
    'Name': ['Nahid', 'Anna', 'Sara', 'Cyrus'],
    'Age': [28, 24, 35, 32],
    'City': ['Tehran', 'Paris', 'Berlin', 'London']
}

df = pd.DataFrame(data)
print(df)

    Name  Age    City
0  Nahid   28  Tehran
1   Anna   24   Paris
2   Sara   35  Berlin
3  Cyrus   32  London

## Basic DataFrame Operations

### 1. Basic Operations

In [9]:
import pandas as pd
df = pd.read_csv('Datasets/pandas/adult.csv')

- `.head()`: Retrieves the first five rows

In [32]:
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capitalGain,capitalLoss,hoursPerWeek,nativeCountry,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

- `.tail()`: Retrieves the last five rows

In [33]:
df.tail()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capitalGain,capitalLoss,hoursPerWeek,nativeCountry,income
32556,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
32557,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
32558,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
32559,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
32560,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

- `.columns`: lists all the column names

In [12]:
df.columns

Index(['age', 'workclass', 'fnlwgt', 'education', 'education-num',
       'marital-status', 'occupation', 'relationship', 'race', 'sex',
       'capitalGain', 'capitalLoss', 'hoursPerWeek', 'nativeCountry',
       'income'],
      dtype='object')

- `len`: length of Dataframe

In [13]:
len(df)

32561

### 2. Accessing Data

Two of the most commonly used methods for accessing data are .loc and .iloc. Each method allows us to retrieve specific rows and columns from a DataFrame, but they do so in slightly different ways.

#### 2–1. Using .loc

The .loc method is label-based, meaning that it allows you to access a group of rows and columns using their labels.   
This is particularly useful when you want to retrieve data based on the specific names of the rows or column headers.  
- loc is used to access data in a DataFrame using label-based indexing.
- df.loc['row_label', 'column_label']

##### 2–1–1. Indexing in loc

In [14]:
df.loc[32559]

age                          22
workclass               Private
fnlwgt                   201490
education               HS-grad
education-num                 9
marital-status    Never-married
occupation         Adm-clerical
relationship          Own-child
race                      White
sex                        Male
capitalGain                   0
capitalLoss                   0
hoursPerWeek                 20
nativeCountry     United-States
income                    <=50K
Name: 32559, dtype: object

- Accessing Specific Data in a DataFrame Using Indexing and Slicing

In [15]:
df.loc[10000, 'education']

'Some-college'

##### 2–1–2. Slicing in loc

- df.loc['row_label_1':'row_label_3', 'column_label_1':'column_label_2']

- For Example:

In [17]:
df.loc[10000:10002, 'age': 'occupation']

,age,workclass,fnlwgt,education,education-num,marital-status,occupation
10000,34,Private,120461,Some-college,10,Divorced,Adm-clerical
10001,23,Private,268145,Bachelors,13,Never-married,Exec-managerial
10002,54,Private,257337,Some-college,10,Married-civ-spouse,Craft-repair

#### 2–2. Using .iloc

On the other hand, the .iloc method is integer-location based, which means it allows you to access rows and columns by their integer index positions.   
This is ideal when the exact position of the rows or columns is known but labels are not.

- Access to one column

In [18]:
df.age

0        39
1        50
2        38
3        53
4        28
         ..
32556    27
32557    40
32558    58
32559    22
32560    52
Name: age, Length: 32561, dtype: int64

##### 2–2–1. indexing in iloc

In [19]:
df.iloc[0]

age                          39
workclass             State-gov
fnlwgt                    77516
education             Bachelors
education-num                13
marital-status    Never-married
occupation         Adm-clerical
relationship      Not-in-family
race                      White
sex                        Male
capitalGain                2174
capitalLoss                   0
hoursPerWeek                 40
nativeCountry     United-States
income                    <=50K
Name: 0, dtype: object

- More than one elements:

In [20]:
df.iloc[0, 1]

'State-gov'

##### 2–2–2. Slicing in iloc

In [24]:
df.iloc[0:2]

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capitalGain,capitalLoss,hoursPerWeek,nativeCountry,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K

In [25]:
df.iloc[0:2, 2:5]

   fnlwgt  education  education-num
0   77516  Bachelors             13
1   83311  Bachelors             13

**Note**: The only difference between a column series and a row series is that the index of   
a column series is the index of the DataFrame, and the index of a row series is the column names.

- Index of a row series:

In [26]:
df.loc[0].index

Index(['age', 'workclass', 'fnlwgt', 'education', 'education-num',
       'marital-status', 'occupation', 'relationship', 'race', 'sex',
       'capitalGain', 'capitalLoss', 'hoursPerWeek', 'nativeCountry',
       'income'],
      dtype='object')

- Index of a column series

In [27]:
df.age.index

RangeIndex(start=0, stop=32561, step=1)

## 3. Filtering Data

In [28]:
# Selecting rows where Age > 89
filtered_df = df[df['age'] > 89]
filtered_df.head(2)

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capitalGain,capitalLoss,hoursPerWeek,nativeCountry,income
222,90,Private,51744,HS-grad,9,Never-married,Other-service,Not-in-family,Black,Male,0,2206,40,United-States,<=50K
1040,90,Private,137018,HS-grad,9,Never-married,Other-service,Not-in-family,White,Female,0,0,40,United-States,<=50K

## 4. Adding New Columns

In [30]:
import numpy as np

choices = ['Low', 'Medium', 'High']  
df['random_category'] = np.random.choice(choices, size=len(df))
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capitalGain,capitalLoss,hoursPerWeek,nativeCountry,income,random_category
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K,High
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K,Low
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K,High
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K,Medium
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K,Medium

## 5. Dropping Columns and Rows

In [31]:
# Dropping the 'Country' column
df = df.drop('random_category', axis=1)
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capitalGain,capitalLoss,hoursPerWeek,nativeCountry,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

# Session 2 - Data Loading and Exploration

## 1. Loading Data from Various Sources

### a. Loading CSV Files

In [3]:
import pandas as pd

df = pd.read_csv('Datasets/pandas/Sales_data.csv')
print(df.head())

   Order ID Product Name  Quantity  Price per Unit  Total Sales  Order Date
0      1001     Widget A         3            15.0         45.0  2023-01-15
1      1002     Widget B         5            22.5        112.5  2023-01-16
2      1003     Widget C         2             8.0         16.0  2023-01-17
3      1004     Widget A         1            15.0         15.0  2023-01-18
4      1005     Widget D         4            30.0        120.0  2023-01-19

### b. Loading Excel Files

In [5]:
df_excel = pd.read_excel('Datasets/pandas/Sales_data.xlsx')
print(df_excel.head())

   Order ID Product Name  Quantity  Price per Unit  Total Sales  Order Date
0      1001     Widget A         3            15.0         45.0  2023-01-15
1      1002     Widget B         5            22.5        112.5  2023-01-16
2      1003     Widget C         2             8.0         16.0  2023-01-17
3      1004     Widget A         1            15.0         15.0  2023-01-18
4      1005     Widget D         4            30.0        120.0  2023-01-19

### c. Loading Data from SQL Databases

In [10]:
import sqlite3

# Connect to a SQLite database
conn = sqlite3.connect('Datasets/pandas/sales_data.db')

# Load data using an SQL query
df_sql = pd.read_sql('SELECT * FROM sales', conn)
conn.close()  

print(df_sql.head())

   Order_ID Product_Name  Quantity  Price_per_Unit  Total_Sales  Order_Date
0      1001     Widget A         3            15.0         45.0  2023-01-15
1      1002     Widget B         5            22.5        112.5  2023-01-16
2      1003     Widget C         2             8.0         16.0  2023-01-17
3      1004     Widget A         1            15.0         15.0  2023-01-18
4      1005     Widget D         4            30.0        120.0  2023-01-19

### d. Loading JSON Files

In [12]:
# Load a JSON file
df_json = pd.read_json('Datasets/pandas/sales_data.json')
print(df_json.head())

   Order ID Product Name  Quantity  Price per Unit  Total Sales  Order Date
0      1001     Widget A         3            15.0         45.0  2023-01-15
1      1002     Widget B         5            22.5        112.5  2023-01-16
2      1003     Widget C         2             8.0         16.0  2023-01-17
3      1004     Widget A         1            15.0         15.0  2023-01-18
4      1005     Widget D         4            30.0        120.0  2023-01-19

## 2. Inspecting DataFrames

### a. Viewing the Top and Bottom Rows

In [13]:
# View the first 5 rows
print(df.head())

print()

# View the last 5 rows
print(df.tail())

   Order ID Product Name  Quantity  Price per Unit  Total Sales  Order Date
0      1001     Widget A         3            15.0         45.0  2023-01-15
1      1002     Widget B         5            22.5        112.5  2023-01-16
2      1003     Widget C         2             8.0         16.0  2023-01-17
3      1004     Widget A         1            15.0         15.0  2023-01-18
4      1005     Widget D         4            30.0        120.0  2023-01-19

   Order ID Product Name  Quantity  Price per Unit  Total Sales  Order Date
0      1001     Widget A         3            15.0         45.0  2023-01-15
1      1002     Widget B         5            22.5        112.5  2023-01-16
2      1003     Widget C         2             8.0         16.0  2023-01-17
3      1004     Widget A         1            15.0         15.0  2023-01-18
4      1005     Widget D         4            30.0        120.0  2023-01-19

### b. Getting a Summary of Your Data

In [14]:
# Get a summary of the DataFrame
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Order ID        5 non-null      int64
 1   Product Name    5 non-null      object
 2   Quantity        5 non-null      int64
 3   Price per Unit  5 non-null      float64
 4   Total Sales     5 non-null      float64
 5   Order Date      5 non-null      object
dtypes: float64(2), int64(2), object(2)
memory usage: 368.0+ bytes
None

### c. Descriptive Statistics

In [15]:
# Get descriptive statistics
print(df.describe())

          Order ID  Quantity  Price per Unit  Total Sales
count     5.000000  5.000000        5.000000     5.000000
mean   1003.000000  3.000000       18.100000    61.700000
std       1.581139  1.581139        8.399405    51.302534
min    1001.000000  1.000000        8.000000    15.000000
25%    1002.000000  2.000000       15.000000    16.000000
50%    1003.000000  3.000000       15.000000    45.000000
75%    1004.000000  4.000000       22.500000   112.500000
max    1005.000000  5.000000       30.000000   120.000000

## 3. Handling Missing Data

### a. Detecting Missing Data

In [16]:
import pandas as pd  
import numpy as np  

data = {  
    'Name': ['Ali', 'Bob', 'Charlie', 'David', 'Eve'],  
    'Age': [25, 30, np.nan, 35, 40],  
    'City': ['Isfahan', 'Madrid', np.nan, 'Chicago', 'Tokyo']  
}  

df = pd.DataFrame(data)  
print(df)

      Name   Age     City
0      Ali  25.0  Isfahan
1      Bob  30.0   Madrid
2  Charlie   NaN      NaN
3    David  35.0  Chicago
4      Eve  40.0    Tokyo

- Pandas uses NaN (Not a Number) to represent missing values. You can detect missing values using the isnull() method.

In [17]:
# Detect missing values
print(df.isnull().sum())

Name    0
Age     1
City    1
dtype: int64

### b. Dropping Missing Data

In [18]:
# Drop rows with missing values
df_cleaned = df.dropna()
df_cleaned

    Name   Age     City
0    Ali  25.0  Isfahan
1    Bob  30.0   Madrid
3  David  35.0  Chicago
4    Eve  40.0    Tokyo

In [19]:
# Drop columns with missing values
df_cleaned = df.dropna(axis=1)
df_cleaned

      Name
0      Ali
1      Bob
2  Charlie
3    David
4      Eve

### c. Filling Missing Data

In [20]:
# Fill missing values with a constant
df_filled = df.fillna(0)
df_filled.head()

      Name   Age     City
0      Ali  25.0  Isfahan
1      Bob  30.0   Madrid
2  Charlie   0.0        0
3    David  35.0  Chicago
4      Eve  40.0    Tokyo

## 4. DataFrame Indexing and Selection

### a. Selecting Columns

In [21]:
# Select a single column
Names = df['Name']
Names

0        Ali
1        Bob
2    Charlie
3      David
4        Eve
Name: Name, dtype: object

In [22]:
# Select multiple columns
age_name = df[['Age', 'City']]
age_name

    Age     City
0  25.0  Isfahan
1  30.0   Madrid
2   NaN      NaN
3  35.0  Chicago
4  40.0    Tokyo

### b. Selecting Rows

- Select rows by index position

In [31]:
import pandas as pd  

# Create the DataFrame  
data = {  
    'Name': ['Ali', 'Bob', 'Charlie', 'David', 'Eve'],  
    'Age': [25.0, 30.0, None, 35.0, 40.0],  
    'City': ['Isfahan', 'Madrid', None, 'Chicago', 'Tokyo']  
}  
df = pd.DataFrame(data)  

# Select rows by index position  
row_0 = df.iloc[0]  
print("Row by index position (0):")  
print(row_0)

Row by index position (0):
Name        Ali
Age        25.0
City    Isfahan
Name: 0, dtype: object

- select rows by index label

In [32]:
# Set a custom index  
df.index = ['A', 'B', 'C', 'D', 'E']  

# Now, select rows by index label  
row_a = df.loc['A']  
print("\nRow by index label ('A'):")  
print(row_a)

Row by index label ('A'):
Name        Ali
Age        25.0
City    Isfahan
Name: A, dtype: object

### c. Boolean Indexing

In [33]:
# Select rows where ages are greater than 30
greater_that_30 = df[df['Age'] > 30]
greater_that_30

    Name   Age     City
D  David  35.0  Chicago
E    Eve  40.0    Tokyo

### d. Setting and Resetting Index

In [34]:
# Set 'Date' as the index
df = df.set_index('Age')
df

         Name     City
Age
25.0      Ali  Isfahan
30.0      Bob   Madrid
NaN   Charlie     None
35.0    David  Chicago
40.0      Eve    Tokyo

In [35]:
# Reset the index
df = df.reset_index()
df

    Age     Name     City
0  25.0      Ali  Isfahan
1  30.0      Bob   Madrid
2   NaN  Charlie     None
3  35.0    David  Chicago
4  40.0      Eve    Tokyo

# Session 3 - Data Cleaning and Preparation

## 1. Data Type Conversion
Data types are the foundation of any dataset, and ensuring that each column has the correct data type is crucial for accurate analysis.

### 1.1 Identifying Data Types

In [2]:
import pandas as pd

# Sample DataFrame
data = {'Name': ['Alex', 'Reza', 'Maryam', 'Irvin'],
        'Age': ['25', '30', '35', '40'],
        'Salary': [70000, 80000, 120000, 90000]}

df = pd.DataFrame(data)
df.dtypes

Name      object
Age       object
Salary     int64
dtype: object

### 1.2 Converting Data Types

In [3]:
# Converting 'Age' to integer
df['Age'] = df['Age'].astype(int)
print(df.dtypes)

Name      object
Age        int64
Salary     int64
dtype: object

### 1.3 Handling Conversion Errors

In [5]:
# Introducing an error in data
df['Age'] = ['25', '30', 'thirty-five', '40']

# Converting with error handling
df['Age'] = pd.to_numeric(df['Age'], errors='coerce')
df

     Name   Age  Salary
0    Alex  25.0   70000
1    Reza  30.0   80000
2  Maryam   NaN  120000
3   Irvin  40.0   90000

## 2. Handling Duplicates
Duplicates can skew your data analysis by giving more weight to certain observations.

### 2.1 Identifying Duplicates

In [6]:
# Sample DataFrame with duplicates
data = {'Name': ['Ebrahim', 'Bob', 'Charlie', 'Ebrahim'],
        'Age': [25, 30, 35, 25],
        'Salary': [70000, 80000, 120000, 70000]}

df = pd.DataFrame(data)
print(df.duplicated())

0    False
1    False
2    False
3     True
dtype: bool

### 2.2 Removing Duplicates

In [7]:
# Removing duplicate rows
df = df.drop_duplicates()
print(df)

      Name  Age  Salary
0  Ebrahim   25   70000
1      Bob   30   80000
2  Charlie   35  120000

## 3. Filling and Dropping Missing Data
Missing data is a common issue, and handling it effectively is key to maintaining data integrity.

### 3.1 Identifying Missing Data

In [8]:
# Sample DataFrame with missing values
data = {'Name': ['Alex', 'Reza', 'Maryam', 'Irvin'],
        'Age': [25, None, 35, 40],
        'Salary': [70000, 80000, None, 90000]}

df = pd.DataFrame(data)
print(df.isnull())

    Name    Age  Salary
0  False  False   False
1  False   True   False
2  False  False    True
3  False  False   False

### 3.2 Dropping Missing Data

In [9]:
# Dropping rows with missing values
df_dropped = df.dropna()
print(df_dropped)

    Name   Age   Salary
0   Alex  25.0  70000.0
3  Irvin  40.0  90000.0

### 3.3 Filling Missing Data

In [10]:
# Filling missing values with a specific value
df_filled = df.fillna({'Age': df['Age'].mean(), 'Salary': df['Salary'].median()})
print(df_filled)

     Name        Age   Salary
0    Alex  25.000000  70000.0
1    Reza  33.333333  80000.0
2  Maryam  35.000000  80000.0
3   Irvin  40.000000  90000.0

## 4. Renaming Columns and Indexes
Consistent and descriptive column names are important for readability and maintainability of your code.

### 4.1 Renaming Columns

In [11]:
# Renaming columns
df = df.rename(columns={'Name': 'Employee Name', 'Age': 'Employee Age'})
print(df)

  Employee Name  Employee Age   Salary
0          Alex          25.0  70000.0
1          Reza           NaN  80000.0
2        Maryam          35.0      NaN
3         Irvin          40.0  90000.0

### 4.2 Renaming Indexes

In [12]:
# Renaming the index
df.index = ['Emp1', 'Emp2', 'Emp3', 'Emp4']
print(df)

     Employee Name  Employee Age   Salary
Emp1          Alex          25.0  70000.0
Emp2          Reza           NaN  80000.0
Emp3        Maryam          35.0      NaN
Emp4         Irvin          40.0  90000.0

# Session 4 - Data Manipulation with Pandas

## 1. Filtering and Selecting Data
Filtering and selecting data are fundamental tasks in data analysis. Pandas provides powerful methods for accessing specific data based on conditions.

### Example: Filtering Sales Data
Imagine you have a DataFrame containing sales data for different products across multiple regions:

In [13]:
import pandas as pd

# Sample DataFrame
data = {
    'Product': ['A', 'B', 'C', 'D'],
    'Region': ['North', 'South', 'East', 'West'],
    'Sales': [250, 400, 300, 200]
}
df = pd.DataFrame(data)

# Filtering for products with sales greater than 250
filtered_df = df[df['Sales'] > 250]
print(filtered_df)

  Product Region  Sales
1       B  South    400
2       C   East    300

## 2. Adding, Modifying, and Deleting Columns
Manipulating columns in a DataFrame is a common task when preparing data for analysis. You may need to add new derived columns, update existing ones, or remove unnecessary columns.

### Example: Adding a Profit Margin Column
Continuing with our sales data, let’s add a new column for profit margin:

In [14]:
# Adding a new column for profit margin
df['Profit Margin'] = [0.1, 0.15, 0.12, 0.08]
print(df)
print()

# Modifying the Sales column to reflect discounted sales
df['Sales'] = df['Sales'] * 0.9
print(df)
print()

# Deleting the Profit Margin column
df.drop('Profit Margin', axis=1, inplace=True)
print(df)

  Product Region  Sales  Profit Margin
0       A  North    250           0.10
1       B  South    400           0.15
2       C   East    300           0.12
3       D   West    200           0.08

  Product Region  Sales  Profit Margin
0       A  North  225.0           0.10
1       B  South  360.0           0.15
2       C   East  270.0           0.12
3       D   West  180.0           0.08

  Product Region  Sales
0       A  North  225.0
1       B  South  360.0
2       C   East  270.0
3       D   West  180.0

## 3. DataFrame Merging and Concatenation
In data analysis, it’s common to work with multiple datasets that need to be combined. Pandas provides robust functions to merge and concatenate DataFrames.

### Example: Merging Sales and Customer Data
Suppose you have a second DataFrame with customer satisfaction scores:

In [15]:
# Sample DataFrame for customer satisfaction
customer_data = {
    'Product': ['A', 'B', 'C', 'D'],
    'Customer Satisfaction': [4.5, 4.7, 4.3, 4.1]
}
df_customers = pd.DataFrame(customer_data)

# Merging sales data with customer satisfaction
merged_df = pd.merge(df, df_customers, on='Product')
print(merged_df)

  Product Region  Sales  Customer Satisfaction
0       A  North  225.0                    4.5
1       B  South  360.0                    4.7
2       C   East  270.0                    4.3
3       D   West  180.0                    4.1

## 4. Reshaping Data: Melt, Pivot, and Pivot Table
Reshaping data is often necessary to transform it into a format suitable for analysis. Pandas offers tools like melt, pivot, and pivot_table for this purpose.

### Example: Reshaping Sales Data with Pivot Table
Let’s assume you want to analyze sales by region and product category:

In [16]:
# Adding a new column for product category
df['Category'] = ['Electronics', 'Electronics', 'Furniture', 'Furniture']
print(df.head())

  Product Region  Sales     Category
0       A  North  225.0  Electronics
1       B  South  360.0  Electronics
2       C   East  270.0    Furniture
3       D   West  180.0    Furniture

# Session 5 - Data Aggregation and Grouping

## 1. Understanding GroupBy Operations

In [17]:
import pandas as pd  

# Sample sales data with different categories  
data = {  
    'Product': ['Laptop', 'Smartphone', 'Sofa', 
                'Chair', 'T-shirt', 'Jeans'], 

    'Category': ['Electronics', 'Electronics', 'Furniture', 
                 'Furniture', 'Clothing', 'Clothing'],  
                 
    'Sales': [1000, 800, 1500, 600, 200, 400]  
}  

df = pd.DataFrame(data)  

# Group by Category and sum the Sales  
category_sales = df.groupby('Category')['Sales'].sum()  
print(category_sales)

Category
Clothing        600
Electronics    1800
Furniture      2100
Name: Sales, dtype: int64

## 2. Aggregation Functions

In [18]:
average_sales = df.groupby('Category')['Sales'].mean()
print(average_sales)
print()

count_sales = df.groupby('Category')['Sales'].count()
print(count_sales)
print()

sum_sales = df.groupby('Category')['Sales'].sum()
print(sum_sales)

Category
Clothing        300.0
Electronics     900.0
Furniture      1050.0
Name: Sales, dtype: float64

Category
Clothing       2
Electronics    2
Furniture      2
Name: Sales, dtype: int64

Category
Clothing        600
Electronics    1800
Furniture      2100
Name: Sales, dtype: int64

## 3. Applying Multiple Aggregations

In [19]:
# Multiple aggregations using agg()
aggregated_sales = df.groupby('Category')['Sales'].agg(['sum', 'mean', 'count'])
print(aggregated_sales)

              sum    mean  count
Category
Clothing      600   300.0      2
Electronics  1800   900.0      2
Furniture    2100  1050.0      2

## 4. Working with Hierarchical Indexes

In [20]:
import pandas as pd  

# Sample data with different categories and regions  
data = {  
    'Product': ['Laptop', 'Smartphone', 
                'Sofa', 'Chair', 
                'T-shirt', 'Jeans'],  

    'Category': ['Electronics', 'Electronics', 
                 'Furniture', 'Furniture', 
                 'Clothing', 'Clothing'],  
                 
    'Region': ['North', 'South', 'West', 'North', 'South', 'East'],  
    'Sales': [1000, 800, 1500, 600, 200, 400]  
}  
df = pd.DataFrame(data)  

# Group by Category and Region, then sum the Sales  
regional_sales = df.groupby(['Category', 'Region'])['Sales'].sum()  
print(regional_sales)

Category     Region
Clothing     East       400
             South      200
Electronics  North     1000
             South      800
Furniture    North      600
             West      1500
Name: Sales, dtype: int64

## 5. Practical Use Case: Sales Data Analysis

In [21]:
# Real-world example: Aggregating sales by category and region
sales_summary = df.groupby(['Category', 'Region'])['Sales'].agg(['sum', 
                                                                 'mean', 
                                                                 'count'])
sales_summary.columns = ['Total Sales', 
                         'Average Sales', 
                         'Number of Transactions']

print(sales_summary)

                    Total Sales  Average Sales  Number of Transactions
Category    Region
Clothing    East            400          400.0                       1
            South           200          200.0                       1
Electronics North          1000         1000.0                       1
            South           800          800.0                       1
Furniture   North           600          600.0                       1
            West           1500         1500.0                       1